# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 10 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
    n: [0.33, 0.25, 1024] # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
    s: [0.33, 0.50, 1024] # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
    m: [0.67, 0.75, 768] # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
    l: [1.00, 1.00, 512] # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
    x: [1.00, 1.25, 512] # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs





#使用新的检测头
# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [ -1, 1, Conv, [ 128,3,2 ] ] # 0-P1/2            0
  - [ -1, 1, Conv, [ 256 ,3,2] ] # 1-P2/4            1
  - [ -1, 3, C2f, [ 256, True ] ] #2                   2
  - [ -1, 1, Conv, [ 512 ,3,2 ]] # 3-P3/8           3
  - [ -1, 3, C2f, [ 256 , True] ] #4                   4
  - [ -1, 1, Conv, [ 1024,3,2 ] ] # 5-P4/16           5
  - [ -1, 3, C2f, [  512 , True] ] #6                      6
  - [ -1, 1, SPPF, [ 512, 5 ] ] # 7                 7

# YOLOv8.0n head
head:
  - [ 2, 1, Conv, [ 256 ] ]  # 8-P2/8               8
  - [ 4, 1, Conv, [ 256 ] ]  # 9-P3/16               9
  - [ 7, 1, Conv, [ 256 ] ]  # 10-P4/32             10

  - [-1, 1,  DySample, []] #11      11
  - [[-1, 9], 1, BiFPN, []] #12 cat backbone P4       12
  - [-1, 3, C2f, [256]] # 13                         13

  - [-1, 1,  DySample, []] #14      14
  - [[-1, 8], 1, BiFPN, []] #15 cat backbone P3        15
  - [-1, 3, C2f, [256]] # 16 (P3/8-small)             16



  - [ 0, 1, Conv, [ 256,3,2  ] ]                   #17
  - [ [ -1, 16, 8 ], 1, BiFPN, [ ] ] # 18            18
  - [ -1, 3, C2f, [ 128] ] # 19-P4/16       19

  - [ -1, 1, Conv, [ 256, 3, 2 ] ] # 20 P5          20
  - [ [ -1, 9,13 ], 1, BiFPN, [ ] ] # 21            21
  - [ -1, 3, C2f, [ 256 ] ]  # 22-P5/32      22

  - [-1, 1, Conv, [256, 3, 2]] #23                  23
  - [[-1, 10], 1,BiFPN, []] #24 cat head P4          24
  - [-1, 3, C2f, [512]] # 25 (P4/16-medium)        25



  - [[19,22,25], 1, Detect_DyHead, [nc,128,2]] # Detect(P3, P4, P5)

#Detect_ASFF
#RTDETRDecoder


